1066mutex/QP_keil_based_tm4c123/bsp.c
    while ((UART0->FR & UART_FR_RXFE) == 0) { /* while RX FIFO NOT empty */
        uint32_t b = UART0->DR;
        QS_RX_PUT(b);
    }
}
#endif

/* Application hooks used in this project ==================================*/
/* NOTE: only the "FromISR" API variants are allowed in vApplicationTickHook */
void vApplicationTickHook(void) { //! called by freeRtos tick() 
    // TODO: check the tick rate with oscilloscope, toggle IO pin
    
    /* state of the button debouncing, see below */
    static struct ButtonsDebouncing {
        uint32_t depressed;
        uint32_t previous;
    } buttons = { ~0U, ~0U };
    uint32_t current;
    uint32_t tmp;
    // booster pack buttons
    //
    static struct ButtonsDebouncing1 {
        uint32_t depressed1;
        uint32_t previous1;
    } buttons1 = { ~0U, ~0U };
    uint32_t current1;
    uint32_t tmp1;
    
    // joystick button debouncing.
    static struct ButtonsDebouncing2 {
        uint32_t depressed1;
        uint32_t previous1;
    } buttons2 = { ~0U, ~0U };
    uint32_t current2;
    uint32_t tmp2;
    //! used to inform RTOS of a thread switch request.
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;

    /* process time events for rate 0 */
    QF_TICK_X_FROM_ISR(0U, &xHigherPriorityTaskWoken, &l_TickHook);

#ifdef Q_SPY
    {
        tmp = SysTick->CTRL; /* clear SysTick_CTRL_COUNTFLAG */
        QS_tickTime_ += QS_tickPeriod_; /* account for the clock rollover */
    }
#endif
// TODO combine all the button debounce into one variable, get the state of each button
//      and pack into one variable then debounce them 

    /* Perform the debouncing of buttons. The algorithm for debouncing
    * adapted from the book "Embedded Systems Dictionary" by Jack Ganssle
    * and Michael Barr, page 71.
    */
    current = ~LEDS_PORT->DATA_Bits[BTN_SW1 | BTN_SW2]; /* read SW1 and SW2 */
    tmp = buttons.depressed; /* save the debounced depressed buttons */
    buttons.depressed |= (buttons.previous & current); /* set depressed */
    buttons.depressed &= (buttons.previous | current); /* clear released */
    buttons.previous   = current; /* update the history */
    tmp ^= buttons.depressed;     /* changed debounced depressed */
    if ((tmp & BTN_SW1) != 0U) {  /* debounced SW1 state changed? */
        if ((buttons.depressed & BTN_SW1) != 0U) { /* is SW1 depressed? */
            /* demonstrate the ISR APIs: QF_PUBLISH_FROM_ISR and Q_NEW_FROM_ISR */
            QF_PUBLISH_FROM_ISR(Q_NEW_FROM_ISR(QEvt, PAUSE_SIG),
                                &xHigherPriorityTaskWoken,
                                &l_TickHook);
        }
        else { /* the button is released */
            /* demonstrate the ISR APIs: POST_FROM_ISR and Q_NEW_FROM_ISR */
            QACTIVE_POST_FROM_ISR(AO_Table,
                                  Q_NEW_FROM_ISR(QEvt, SERVE_SIG),
                                  &xHigherPriorityTaskWoken,
                                  &l_TickHook);
        }
    }
    //! debounce BoosterPack user buttons TODO: can select not to use the tiva buttons.
    current1 = ~BSTR_BTN_SWS_PORT->DATA_Bits[BSTR_BTN_SW3 | BSTR_BTN_SW4]; /* read SW1 and SW2 */
    tmp1 = buttons1.depressed1;                                              /* save the debounced depressed1 buttons1 */
    buttons1.depressed1 |= (buttons1.previous1 & current1);                    /* set depressed1 */
    buttons1.depressed1 &= (buttons1.previous1 | current1);                    /* clear released */
    buttons1.previous1 = current1;                                           /* update the history */
    tmp1 ^= buttons1.depressed1;                                             /* changed debounced depressed1 */
    if ((tmp1 & BSTR_BTN_SW3) != 0U) {                                     /* debounced SW1 state changed? */
        if ((buttons1.depressed1 & BSTR_BTN_SW3) != 0U) {                   /* is SW1 depressed1? */
            /* demonstrate the ISR APIs: QF_PUBLISH_FROM_ISR and Q_NEW_FROM_ISR */
            QF_PUBLISH_FROM_ISR(Q_NEW_FROM_ISR(QEvt, BUTTON3_PRESSED_SIG),
                                &xHigherPriorityTaskWoken,
                                &l_TickHook);
        } else { /* the button is released */
            /* demonstrate the ISR APIs: POST_FROM_ISR and Q_NEW_FROM_ISR */
            QACTIVE_POST_FROM_ISR(AO_Heartbeat, // BUG: this was set to AO_table
                                  Q_NEW_FROM_ISR(QEvt, BUTTON3_DEPRESSED_SIG),
                                  &xHigherPriorityTaskWoken,
                                  &l_TickHook);
        }
    }

    if ((tmp1 & BSTR_BTN_SW4) != 0U) {                   /* debounced SW1 state changed? */
        if ((buttons1.depressed1 & BSTR_BTN_SW4) != 0U) { /* is SW1 depressed1? */
            /* demonstrate the ISR APIs: QF_PUBLISH_FROM_ISR and Q_NEW_FROM_ISR */
            static QEvt const btn4prsEvt = {BUTTON4_PRESSED_SIG, 0U, 0U};
            QF_PUBLISH_FROM_ISR(&btn4prsEvt, &xHigherPriorityTaskWoken, &l_TickHook);  // BUG: run QF_psInit()

        } else { /* the button is released */
            /* demonstrate the ISR APIs: POST_FROM_ISR and Q_NEW_FROM_ISR */
            static QEvt const btn4DeprsEvt = {BUTTON4_DEPRESSED_SIG, 0U, 0U};
            QF_PUBLISH_FROM_ISR(&btn4DeprsEvt, &xHigherPriorityTaskWoken, &l_TickHook);
        }
    }

    //! debounce BoosterPack Joystick button TODO: can select not to use the tiva buttons.
    current2 = ~BSP_BP_JST_BTN_PORT->DATA_Bits[BSP_BP_JST_BTN_PIN]; /* read SW1 and SW2 */
    tmp2 = buttons2.depressed1;                                              /* save the debounced depressed1 buttons1 */
    buttons2.depressed1 |= (buttons2.previous1 & current2);                    /* set depressed1 */
    buttons2.depressed1 &= (buttons2.previous1 | current2);                    /* clear released */
    buttons2.previous1 = current2;                                           /* update the history */
    tmp2 ^= buttons2.depressed1;                                             /* changed debounced depressed1 */
    if ((tmp2 & BSP_BP_JST_BTN_PIN) != 0U) {                                 /* debounced SW1 state changed? */
        if ((buttons2.depressed1 & BSP_BP_JST_BTN_PIN) != 0U) {              /* is SW1 depressed1? */
            /* demonstrate the ISR APIs: QF_PUBLISH_FROM_ISR and Q_NEW_FROM_ISR */
            QF_PUBLISH_FROM_ISR(Q_NEW_FROM_ISR(QEvt, JOYSTICK_PRESSED_SIG),
                                &xHigherPriorityTaskWoken,
                                &l_TickHook);
        } else { /* the button is released */
            /* demonstrate the ISR APIs: POST_FROM_ISR and Q_NEW_FROM_ISR */
            QACTIVE_POST_FROM_ISR(AO_Heartbeat, // BUG: this was set to AO_table
                                  Q_NEW_FROM_ISR(QEvt, JOYSTICK_DEPRESSED_SIG),
                                  &xHigherPriorityTaskWoken,
                                  &l_TickHook);
        }
    }
    /* notify FreeRTOS to perform context switch from ISR, if needed */
    portEND_SWITCHING_ISR(xHigherPriorityTaskWoken);
}
/*..........................................................................*/
void vApplicationIdleHook(void) {
    float volatile x;

    /* toggle the User LED on and then off, see NOTE01 */
      QF_INT_DISABLE();
    GPIOF->DATA_Bits[LED_BLUE] = 0xFFU;  /* turn the Blue LED on  */
    GPIOF->DATA_Bits[LED_BLUE] = 0U;     /* turn the Blue LED off */
    QF_INT_ENABLE();

    /* Some flating point code is to exercise the VFP... */
    x = 1.73205F;
    x = x * 1.73205F;

#ifdef Q_SPY
    QS_rxParse();  /* parse all the received bytes */

