1066mutex/QP_keil_based_tm4c123/bsp.c
}



// ------------BSP_Buzzer_Set------------
// Set new duty cycle for the buzzer.
// 512 is typical for sound (50% duty cycle).
// 0 is typical for silent (0% duty cycle).
// Input: duty is 10-bit duty cycle for the buzzer
// Output: none
// Assumes: BSP_Buzzer_Init() has been called
//! the duty affects the output volume !!duty ++ = low volume
void BSP_BP_Buzzer_Set(uint16_t duty) {
    if (duty > 65023) {
        return;  // invalid input
    }
    PWM1->ENABLE &= ~(1U << 6);
    // TIMER1->CTL &= ~((0x00000040) | (0x00000001));
    PWM1->_3_LOAD = duty;
    PWM1->_3_CMPA = (duty * 40) / 100;  // defines when output signal is cleared
    PWM1->ENABLE |= (1U << 6);
    //! can use duty as % thus TAMATCHR = duty*pwmcycles
    // TIMER1->CTL |= ((0x00000040) | (0x00000001));
}

/**Buzzer TODO:
 * function to adjust frequency(tone) 
 * assumes no divider is used for frequency 50 mhz.
 */
void BSP_BP_Buzzer_Freq(float32_t freq) {
    // system clock/required frequency.
    float32_t loadValue = (freq);
    uint16_t sysPMW = (loadValue * PWM_sysclk);
    PWM1->_3_LOAD = sysPMW;
    PWM1->_3_CMPA = (sysPMW * 30 / 100);
}
//TODO: Test the frequency on a scope for correctness.
//      Idea. use uint instead of float avoid floating point math?


// pwm on pf2 PWM4 M1PWM6

/**!
 * TODO: led initialisation
 * -- Initialize all leds as digital 
 * -- Initialise all leds as PWM
 * 
 * -- control individual led pwm. 
 */


void BSP_BP_D_LedsInit(void){

// initialise  PB3 PC4 PF3
/* enable Run mode for GPIOB, GPIOC, GPIOF */
SYSCTL->RCGCGPIO |= PORTB | PORTC | PORTF;
/* configure BOOSTER PCK Switches and leds */
/* BSTR_LED_RED_PORT BSTR_LED_RED have been configured above, same PF1 used */
// PB3
BSTR_LED_GREEN_PORT->DIR |= (BSTR_LED_GREEN);    /* set as output */
BSTR_LED_GREEN_PORT->AFSEL &= ~(BSTR_LED_GREEN); /* disable alt funct on PB3 */
BSTR_LED_GREEN_PORT->PUR &= ~(BSTR_LED_GREEN);   /* disable pull-up on PB3 */
BSTR_LED_GREEN_PORT->DEN |= (BSTR_LED_GREEN);    /* digital enable */
// PC4
BSTR_LED_BLUE_PORT->DIR |= (BSTR_LED_BLUE);    /* set as output */
BSTR_LED_BLUE_PORT->AFSEL &= ~(BSTR_LED_BLUE); /* disable alt funct on PC4 */
BSTR_LED_BLUE_PORT->PUR &= ~(BSTR_LED_BLUE);   /* disable pull-up on PC4 */
BSTR_LED_BLUE_PORT->DEN |= (BSTR_LED_BLUE);    /* digital enable */
// PF3
BSTR_LED_RED_PORT->DEN |= (BSTR_LED_RED);    /* digital enable */
BSTR_LED_RED_PORT->AFSEL &= ~(BSTR_LED_RED); /* disable alt funct on PF3 */
BSTR_LED_RED_PORT->PUR &= ~(BSTR_LED_RED);   /* disable pull-up on PF3 */
BSTR_LED_RED_PORT->DIR |= (BSTR_LED_RED);    /* set as output */
// turn off all leds.
BSTR_LED_GREEN_PORT->DATA_Bits[BSTR_LED_GREEN] = BSTR_LED_GREEN; /* turn the LED off */
BSTR_LED_BLUE_PORT->DATA_Bits[BSTR_LED_BLUE] = BSTR_LED_BLUE;    /* turn the LED off */
BSTR_LED_RED_PORT->DATA_Bits[BSTR_LED_RED] = BSTR_LED_RED;       /* turn the LED off */
}


void BSP_BP_RGB_ledsInit(void) {
    // enable Run mode for GPIOB, GPIOC, GPIOF
    //
    SYSCTL->RCGCGPIO |= PORTB | PORTC | PORTF;

    // configure I/O pins for PWM mode.
    //
    // PB3
    BSTR_LED_GREEN_PORT->DIR |= (BSTR_LED_GREEN);                                         /* set as output */
    BSTR_LED_GREEN_PORT->AFSEL |= (BSTR_LED_GREEN);                                       /* enable alt funct on PB3 */
    BSTR_LED_GREEN_PORT->PUR &= ~(BSTR_LED_GREEN);                                        /* disable pull-up on PB3 */
    BSTR_LED_GREEN_PORT->PCTL |= ((BSTR_LED_GREEN_PORT->PCTL & 0xFFFF0FFF) + 0x00007000); /* configure PB3 as PWM */
    BSTR_LED_GREEN_PORT->AMSEL &= ~(BSTR_LED_GREEN);                                      /* disable analog functionality */
    BSTR_LED_GREEN_PORT->DEN |= (BSTR_LED_GREEN);                                         /* digital enable */
    // PC4
    BSTR_LED_BLUE_PORT->DIR |= (BSTR_LED_BLUE);                                         /* set as output */
    BSTR_LED_BLUE_PORT->AFSEL |= (BSTR_LED_BLUE);                                      /* disable alt funct on PC4 */
    BSTR_LED_BLUE_PORT->PUR &= ~(BSTR_LED_BLUE);                                        /* disable pull-up on PC4 */
    BSTR_LED_BLUE_PORT->PCTL |= ((BSTR_LED_BLUE_PORT->PCTL & 0xFFF0FFFF) + 0x00070000); /* configure PC4 as PWM */
    BSTR_LED_BLUE_PORT->AMSEL &= ~(BSTR_LED_BLUE);                                      /* disable analog functionality */
    BSTR_LED_BLUE_PORT->DEN |= (BSTR_LED_BLUE);                                         /* digital enable */
    // PF3 for Timer1B
    BSTR_LED_RED_PORT->DIR |= (BSTR_LED_RED);                                         /* set as output */
    BSTR_LED_RED_PORT->AFSEL |= (BSTR_LED_RED);                                      /* disable alt funct on PF3 */
    BSTR_LED_RED_PORT->PUR &= ~(BSTR_LED_RED);                                        /* disable pull-up on PF3 */
    BSTR_LED_RED_PORT->PCTL |= ((BSTR_LED_RED_PORT->PCTL & 0xFFFF0FFF) + 0x00007000); /* configure PF3 as PWM */
    BSTR_LED_RED_PORT->AMSEL &= ~(BSTR_LED_RED);                                      /* disable analog functionality */
    BSTR_LED_RED_PORT->DEN |= (BSTR_LED_RED);                                       /* digital enable */

    // enable Timers for pwm clock
    //
    // ***************** Timer1B (PF3) initialization *****************
    SYSCTL->RCGCTIMER |= 0x02;  // activate clock for Timer1

    while ((SYSCTL->PRTIMER & 0x02) == 0) {
    };                             // allow time for clock to stabilize
    TIMER1->CTL &= ~(0x00000100);  // disable Timer1B during setup
    TIMER1->CFG = 0x00000004;      // configure for 16-bit timer mode
                                   // configure for alternate (PWM) mode
    TIMER1->TBMR = (0x00000008 | 0x00000002);
    TIMER1->TBILR = PWM_CYCLES;                // defines when output signal is set
    //TIMER1->TBMATCHR register is not set, keeps pwm output at 0
    //
    // enable Timer1B 16-b, PWM, inverted to match comments
    TIMER1->CTL |= (0x00004000 | 0x00000100);  
    //==============================================================================================  

    // ***************** Timer3B (PB3) initialization *****************
    SYSCTL->RCGCTIMER |= 0x08;  // activate clock for Timer1

