1066mutex/QP_keil_based_tm4c123/bsp.c
    while ((SYSCTL->PRTIMER & 0x08) == 0) {};   // allow time for clock to stabilize
    TIMER3->CTL &= ~(0x00000100);               // disable Timer3B during setup
    TIMER3->CFG = 0x00000004;                   // configure for 16-bit timer mode
                                                // configure for alternate (PWM) mode
    TIMER3->TBMR = (0x00000008 | 0x00000002);
    TIMER3->TBILR = PWM_CYCLES;                  // defines when output signal is set
    //TIMER3->TBMATCHR register is not set, keeps pwm output at 0
    //
    // enable Timer1B 16-b, PWM, inverted to match comments
    TIMER3->CTL |= (0x00004000 | 0x00000100);   // enable PWM

    //==============================================================================================

    // ***************** Wide Timer0A (PC4) initialization *****************
    SYSCTL->RCGCWTIMER |= 0x01;  // activate clock for Wide Timer0

    while ((SYSCTL->PRWTIMER & 0x01) == 0) {};  // allow time for clock to stabilize
    WTIMER0->CTL &= ~(0x0000001);               // disable Timer3B during setup
    WTIMER0->CFG = 0x00000004;                  // configure for 32-bit timer mode
                                                // configure for alternate (PWM) mode
    WTIMER0->TAMR = (0x00000008 | 0x00000002);
    WTIMER0->TAILR = PWM_CYCLES;                 // defines when output signal is set
    //WTIMER0->TAMATCHR register is not set, keeps pwm output at 0 
    //
    // enable Wide Timer0A 32-b, PWM, inverted to match comments
    WTIMER0->CTL |= (0x00000040 | 0x00000001);  
    //==============================================================================================

    // End of function ====================================================================//
}

// set pwm for each led
// assumes that led rgb init has been called
// takes duty cycle as percentage.
// ! check! duty == 0 pwm on for 20ns the lowest to disable use pwm disable. 
void BSP_BP_LedRedDuty(uint8_t dutyCycle){
    if (dutyCycle > 100) {
        /* duty cycle is out of range do nothing */
        return; // todo: can assert here.
    }
    TIMER1->TBMATCHR = ((PWM_CYCLES*dutyCycle)/100)-1;
}
void BSP_BP_LedGreenDuty(uint8_t dutyCycle){
    if (dutyCycle > 100) {
        /* duty cycle is out of range do nothing */
        return; // todo: can assert here.
    }
    TIMER3->TBMATCHR = ((PWM_CYCLES*dutyCycle)/100)-1;
}
void BSP_BP_LedBlueDuty(uint8_t dutyCycle){
    if (dutyCycle > 100) {
        /* duty cycle is out of range do nothing */
        return; // todo: can assert here.
    }
    WTIMER0->TAMATCHR = ((PWM_CYCLES*dutyCycle)/100)-1;
}

/**
 * TODO: ERROR HANDLING for pwm usage
 * before setting duty cycle check if pwm timer is enabled first
 * we can assert if timer is not enable or just enble then set new duty
 *  = time enable and disable() for power mangment when led duty is set to 0.
 *  = this will reduce the power consumed by the timer.
 */

// Booster pack display using spi============================================

// The Data/Command pin must be valid when the eighth bit is
// sent.  The SSI module has hardware input and output FIFOs
// that are 8 locations deep; however, they are not used in
// this implementation.  Each function first stalls while
// waiting for any pending SSI2 transfers to complete.  Once
// the SSI2 module is idle, it then prepares the Chip Select
// pin for the LCD and the Data/Command pin.  Next it starts
// transmitting the data or command.  Finally once the
// hardware is idle again, it sets the chip select pin high
// as required by the serial protocol.  This is a
// significant change from previous implementations of this
// function.  It is less efficient without the FIFOs, but it
// should ensure that the Chip Select and Data/Command pin
// statuses all match the byte that is actually being
// transmitted.
// NOTE: These functions will crash or stall indefinitely if
// the SSI2 module is not initialized and enabled.

// This is a helper function that sends an 8-bit command to the LCD.
// Inputs: c  8-bit code to transmit
// Outputs: 8-bit reply
// Assumes: SSI2 and ports have already been initialized and enabled
uint8_t BSP_BP_SPIwritecommand(uint8_t c) {
    // wait until SSI2 not busy/transmit FIFO empty
    // todo remove while loop, blocking
    while ((SSI2->SR & 0x00000010) == 0x00000010) {};
    BSP_BP_TFT_CS_LOW();
    BSP_BP_TFT_DC_COMMAND();
    SSI2->DR = c;  // data out
    while ((SSI2->SR & 0x00000004) == 0) {};  // wait until response
    BSP_BP_TFT_CS_HIGH();
    return (uint8_t)SSI2->DR;  // return the response
}
// This is a helper function that sends a piece of 8-bit data to the LCD.
// Inputs: c  8-bit data to transmit
// Outputs: 8-bit reply
// Assumes: SSI2 and ports have already been initialized and enabled
uint8_t BSP_BP_SPIwritedata(uint8_t c) {
    // wait until SSI2 not busy/transmit FIFO empty
    // todo remove while loop.
    while ((SSI2->SR & 0x00000010) == 0x00000010) {};
    BSP_BP_TFT_CS_LOW();
    BSP_BP_TFT_DC_DATA();
    SSI2->DR = c;  // data out
    while ((SSI2->SR & 0x00000004) == 0) {};  // wait until response
    BSP_BP_TFT_CS_HIGH();
    return (uint8_t)SSI2->DR;  // return the response
}

//! delay function required for initialisation of LCD display.
//BUG: not sure if this will work with the arm none eabi gcc compiler!
// try the TI compiler version  

// delay function from sysctl.c
// which delays 3.3*ulCount cycles
// ulCount=23746 => 1ms = 23746*3.3cycle/loop/80,000
#ifdef __TI_COMPILER_VERSION__
//Code Composer Studio Code
void parrotdelay(uint32_t ulCount) {
    __asm(
        "    subs    r0, #1\n"
        "    bne     Delay\n"
        "    bx      lr\n");
}

#else
//Keil uVision Code
__asm void
parrotdelay(uint32_t ulCount) {
    subs    r0, #1 
    bne     parrotdelay
    bx      lr
}

#endif

// ------------BSP_Delay1ms------------
// Simple delay function which delays about n
// milliseconds.
// Inputs: n  number of 1 msec to wait
// Outputs: none
// Note: this is based on a 80Mhz sysClk
void BSP_Delay1ms(uint32_t n) {
    while (n) {
        parrotdelay(23746);  // 1 msec, tuned at 80 MHz, originally part of LCD module
        n--;
    }
}

// Initialization SPI interface for BP TFT display.
void BSP_BP_SPI_TFT_Init(void) {
    // toggle RST low to reset; CS low so it'll listen to us
    // SSI2Fss is not available, so use GPIO on PA4
    SYSCTL->RCGCGPIO |= 0x00000023;  // 1) activate clock for Ports F, B, and A
    while ((SYSCTL->PRGPIO & 0x23) != 0x23) {
    };                                   // allow time for clocks to stabilize
    BP_LCD_RST_PORT->LOCK = 0x4C4F434B;  // 2a) unlock GPIO Port F
    BP_LCD_RST_PORT->CR = 0x1F;          // allow changes to PF4-0
                                         // 2b) no need to unlock PF4, PB7, PB4, or PA4
    BP_LCD_RST_PORT->AMSEL &= ~0x11;     // 3a) disable analog on PF4,0
    BP_SPI_DATA_PORT->AMSEL &= ~0x90;    // 3b) disable analog on PB7,4
    BP_SPI_CS_PORT->AMSEL &= ~0x10;      // 3c) disable analog on PA4
                                         // 4a) configure PF4,0 as GPIO
    BP_LCD_RST_PORT->PCTL = (BP_LCD_RST_PORT->PCTL & 0xFFF0FFF0) + 0x00000000;
    // 4b) configure PB7,4 as SSI
    BP_SPI_DATA_PORT->PCTL = (BP_SPI_DATA_PORT->PCTL & 0x0FF0FFFF) + 0x20020000;
    // 4c) configure PA4 as GPIO
    BP_SPI_CS_PORT->PCTL = (BP_SPI_CS_PORT->PCTL & 0xFFF0FFFF) + 0x00000000;
    BP_LCD_RST_PORT->DIR |= 0x11;     // 5a) make PF4,0 output
    BP_SPI_CS_PORT->DIR |= 0x10;      // 5b) make PA4 output
    BP_LCD_RST_PORT->AFSEL &= ~0x11;  // 6a) disable alt funct on PF4,0
    BP_SPI_DATA_PORT->AFSEL |= 0x90;  // 6b) enable alt funct on PB7,4
    BP_SPI_CS_PORT->AFSEL &= ~0x10;   // 6c) disable alt funct on PA4
    BP_LCD_RST_PORT->DEN |= 0x11;     // 7a) enable digital I/O on PF4,0
    BP_SPI_DATA_PORT->DEN |= 0x90;    // 7b) enable digital I/O on PB7,4
    BP_SPI_CS_PORT->DEN |= 0x10;      // 7c) enable digital I/O on PA4

    // reset display
    BSP_BP_TFT_CS_LOW();
    BSP_BP_TFT_RESET_HIGH();
    BSP_Delay1ms(50);
    BSP_BP_TFT_RESET_LOW();
    BSP_Delay1ms(50);
    BSP_BP_TFT_RESET_HIGH();
    BSP_Delay1ms(50);
    BSP_BP_TFT_CS_HIGH();

