1066mutex/QP_keil_based_tm4c123/bsp.c
// trigger the ADC to sample the MCU temperature sensor.
void BSP_SystemTempGet(void) {
    ADC0->PSSI |= (1 << 3); /* Enable SS3 conversion or start sampling data from AN0 */
}

// ------------BSP_Accelerometer_Init------------
// Initialize three ADC pins, which correspond with
// BoosterPack pins J3.23 (X), J3.24 (Y), and
// J3.25 (Y).
// Input: none
// Output: none
void BSP_Accelerometer_Init(void) {
    adcinit();
    SYSCTL->RCGCGPIO |= 0x00000008;  // 1) activate clock for Port D
    while ((SYSCTL->PRGPIO & 0x08) == 0) {
    };                           // allow time for clock to stabilize
                                 // 2) no need to unlock PD2-0
    GPIOD->AMSEL |= 0x07;  // 3) enable analog on PD2-0
                                 // 4) configure PD2-0 as ?? (skip this line because PCTL is for digital only)
    GPIOD->DIR &= ~0x07;   // 5) make PD2-0 input
    GPIOD->AFSEL |= 0x07;  // 6) enable alt funct on PD2-0
    GPIOD->DEN &= ~0x07;   // 7) enable analog functionality on PD2-0
    adcinit();                   // 8-9) general ADC initialization
    ADC0->ACTSS &= ~0x0004;     // 10) disable sample sequencer 2
    ADC0->EMUX &= ~0x0F00;      // 11) seq2 is software trigger
    ADC0->SSMUX2 = 0x0567;      // 12) set channels for SS2
    ADC0->SSCTL2 = 0x0600;      // 13) no D0 END0 IE0 TS0 D1 END1 IE1 TS1 D2 TS2, yes IE2 END2
    ADC0->IM &= ~0x0004;        // 14) disable SS2 interrupts
    ADC0->ACTSS |= 0x0004;      // 15) enable sample sequencer 2
}

// ------------BSP_Accelerometer_Input------------
// Read and return the immediate status of the
// accelerometer.  The accelerometer X-, Y-, and
// Z-measurements are returned as 10-bit numbers,
// even if the ADC on the LaunchPad is more precise.
// Input: x is pointer to store X-measurement (0 to 1023)
//        y is pointer to store Y-measurement (0 to 1023)
//        z is pointer to store Z-measurement (0 to 1023)
// Output: none
// Assumes: BSP_Accelerometer_Init() has been called
void BSP_Accelerometer_Input(uint16_t *x, uint16_t *y, uint16_t *z) {
    ADC0->PSSI = 0x0004;  // 1) initiate SS2
    // TODO: add while loop timeout
    while ((ADC0->RIS & 0x04) == 0) {};// 2) wait for conversion done
    *x = ADC0->SSFIFO2 >> 2;  // 3a) read first result
    *y = ADC0->SSFIFO2 >> 2;  // 3b) read second result
    *z = ADC0->SSFIFO2 >> 2;  // 3c) read third result
    ADC0->ISC = 0x0004;       // 4) acknowledge completion
}

// trigger the ADC to sample the Accelerometer sensor.
void BSP_AccelerometerGet(void) {
    ADC0->PSSI |= (1 << 2);  // initiate SS2
}

// TODO: isr for accelerometer ADC

// TODO: use the ADC1 for the microphone. can set higher sample rate. change ADC0 to ADC1.
//       isr for microphone

// ------------BSP_Microphone_Init------------
// Initialize one ADC pin, which corresponds with
// BoosterPack pin J1.6. tm4c123 pin PE5.
// Input: none
// Output: none
void BSP_Microphone_Init(void) {
    adcinit();
    SYSCTL->RCGCGPIO |= 0x00000010;  // 1) activate clock for Port E
    while ((SYSCTL->PRGPIO & 0x10) == 0) {
    };                           // allow time for clock to stabilize
                                 // 2) no need to unlock PE5
    GPIOE->AMSEL |= 0x20;  // 3) enable analog on PE5
                                 // 4) configure PE5 as ?? (skip this line because PCTL is for digital only)
    GPIOE->DIR &= ~0x20;   // 5) make PE5 input
    GPIOE->AFSEL |= 0x20;  // 6) enable alt funct on PE5
    GPIOE->DEN &= ~0x20;   // 7) enable analog functionality on PE5
    adcinit();                   // 8-9) general ADC initialization
    ADC0->ACTSS &= ~0x0008;     // 10) disable sample sequencer 3
    ADC0->EMUX &= ~0xF000;      // 11) seq3 is software trigger
    ADC0->SSMUX3 = 0x0008;      // 12) set channels for SS3
    ADC0->SSCTL3 = 0x0006;      // 13) no D0 TS0, yes IE0 END0
    ADC0->IM &= ~0x0008;        // 14) disable SS3 interrupts
    ADC0->ACTSS |= 0x0008;      // 15) enable sample sequencer 3
}

// ------------BSP_Microphone_Input------------
// Read and return the immediate status of the
// microphone.  The sound measurement is returned
// as a 10-bit number, even if the ADC on the
// LaunchPad is more precise.
// Input: mic is pointer to store sound measurement (0 to 1023)
// Output: none
// Assumes: BSP_Microphone_Init() has been called
void BSP_Microphone_Input(uint16_t *mic) {
    // ADC0->PSSI = 0x0008;  // 1) initiate SS3
    // while ((ADC0->RIS & 0x08) == 0) {
    // };                           // 2) wait for conversion done
    *mic = ADC0->SSFIFO3 >> 2;  // 3) read result
    ADC0->ISC = 0x0008;         // 4) acknowledge completion
}

// trigger the ADC to sample the mic input.
void BSP_Microphone_Get(void){
    ADC0->PSSI = 0x0008;  // 1) initiate SS3
}


// I2C initialization==============================================

// There are two I2C devices on the Educational BoosterPack MKII:
// OPT3001 Light Sensor
// !TMP006 Temperature sensor not populated.
// Both initialization functions can use this general I2C
// initialization.
#define MAXRETRIES 5  // number of receive attempts before giving up
void static i2cinit(void) {
    SYSCTL->RCGCI2C |= 0x0002;   // 1a) activate clock for I2C1
    SYSCTL->RCGCGPIO |= PORTA;   // 1b) activate clock for Port A
    while ((SYSCTL->PRGPIO & 0x01) == 0) {  // TODO: add while loop timeout
    };                                      // allow time for clock to stabilize
                                            // 2) no need to unlock PA7-6
    GPIOA->AMSEL &= ~0xC0;        // 3) disable analog functionality on PA7-6
                                  // 4) configure PA7-6 as I2C1
    GPIOA->PCTL = (GPIOA->PCTL & 0x00FFFFFF) + 0x33000000;
    GPIOA->ODR |= 0x80;           // 5) enable open drain on PA7 only
    GPIOA->AFSEL |= 0xC0;         // 6) enable alt funct on PA7-6
    GPIOA->DEN |= 0xC0;           // 7) enable digital I/O on PA7-6
    I2C1->MCR = 0x00000010;       // 8) master function enable
    I2C1->MTPR = 39;              // 9) configure for 100 kbps clock
                                  // 20*(TPR+1)*12.5ns = 10us, with TPR=39

