1066mutex/QP_keil_based_tm4c123/bsp.c
}

static void L_waitTillReady(void) {
    while (I2C1->MCS & I2C_MCS_BUSY) {  // TODO: add while loop timeout
    };
}
// receives two bytes from specified slave
// Note for HMC6352 compass only:
// Used with 'A' commands
// Note for TMP102 thermometer only:
// Used to read the contents of the pointer register
uint16_t BSP_I2C_Recv2(int8_t slave){
    uint8_t data1, data2;
    int retryCounter = 1;
    do {
        L_waitTillReady();            // wait for I2C ready
        I2C1->MSA = (slave << 1) & 0xFE;  // MSA[7:1] is slave address
        I2C1->MSA |= 0x01;                // MSA[0] is 1 for receive
       
        I2C1->MCS = (I2C_MCS_ACK          // positive data ack
                     //& ~I2C_MCS_STOP    // no stop
                      | I2C_MCS_START      // generate start/restart
                      | I2C_MCS_RUN);      // master enable
        L_waitTillReady();           // wait for transmission done
        data1 = (I2C1->MDR & 0xFF);  // MSB data sent first

        I2C1->MCS = (I2C_MCS_STOP    // generate stop
                    //& ~I2C_MCS_ACK     // negative data ack (last byte)
                    //& ~I2C_MCS_START   // no start/restart
                    | I2C_MCS_RUN);  // master enable
        L_waitTillReady();               // wait for transmission done
        data2 = (I2C1->MDR & 0xFF);      // LSB data sent last
        retryCounter = retryCounter + 1;  // increment retry counter
    }                                     // repeat if error
    while (((I2C1->MCS & (I2C_MCS_ADRACK | I2C_MCS_ERROR)) != 0) && (retryCounter <= MAXRETRIES));
    return (data1 << 8) + data2;  // usually returns 0xFFFF on error
}

// sends one byte to specified slave
// Note for HMC6352 compass only:
// Used with 'S', 'W', 'O', 'C', 'E', 'L', and 'A' commands
//  For 'A' commands, I2C_Recv2() should also be called
// Note for TMP102 thermometer only:
// Used to change the pointer register
// Returns 0 if successful, nonzero if error
uint16_t BSP_I2C_Send1(int8_t slave, uint8_t data1) {
    while (I2C1->MCS & I2C_MCS_BUSY) {
    };                                 // wait for I2C ready
    I2C1->MSA = (slave << 1) & 0xFE;  // MSA[7:1] is slave address
    I2C1->MSA &= ~0x01;               // MSA[0] is 0 for send
    I2C1->MDR = data1 & 0xFF;         // prepare first byte
    I2C1->MCS = (0
                  //                       & ~I2C_MCS_ACK     // no data ack (no data on send)
                  | I2C_MCS_STOP   // generate stop
                  | I2C_MCS_START  // generate start/restart
                  | I2C_MCS_RUN);  // master enable
    while (I2C1->MCS & I2C_MCS_BUSY) {  // TODO: add while loop timeout
    };                                  // wait for transmission done
        // return error bits
    return (I2C1->MCS & (I2C_MCS_DATACK | I2C_MCS_ADRACK | I2C_MCS_ERROR));
}



uint16_t BSP_I2C_Send3(int8_t slave, uint8_t data1, uint8_t data2, uint8_t data3) {
    L_waitTillReady();
    I2C1->MSA = (slave << 1) & 0xFE;  // MSA[7:1] is slave address
    I2C1->MSA &= ~0x01;               // MSA[0] is 0 for send
    I2C1->MDR = data1 & 0xFF;         // prepare first byte

    I2C1->MCS = (I2C_MCS_START       // generate start/restart
                 | I2C_MCS_RUN);     // master enable
                                     // & ~I2C_MCS_ACK    // no data ack (no data on send)
                                     // & ~I2C_MCS_STOP   // no stop
    L_waitTillReady();               // wait for transmission done
        // check error bits
    if ((I2C1->MCS & (I2C_MCS_DATACK | I2C_MCS_ADRACK | I2C_MCS_ERROR)) != 0) {
        // send stop if nonzero
        I2C1->MCS = (I2C_MCS_STOP);  // stop
                                     //  & ~I2C_MCS_ACK     // no data ack (no data on send)
                                     //  & ~I2C_MCS_START   // no start/restart
                                     //  & ~I2C_MCS_RUN     // master disable

        // return error bits if nonzero
        return (I2C1->MCS & (I2C_MCS_DATACK | I2C_MCS_ADRACK | I2C_MCS_ERROR));
    }
    I2C1->MDR = data2 & 0xFF;       // prepare second byte

    I2C1->MCS = (I2C_MCS_RUN);     // master enable

                                   //& ~I2C_MCS_ACK     // no data ack (no data on send)
                                   //& ~I2C_MCS_STOP    // no stop
                                   //& ~I2C_MCS_START   // no start/restart
    L_waitTillReady();             // wait for transmission done
        // check error bits
    if ((I2C1->MCS & (I2C_MCS_DATACK | I2C_MCS_ADRACK | I2C_MCS_ERROR)) != 0) {
        // send stop if nonzero
        I2C1->MCS = (0 | I2C_MCS_STOP);  // stop

                                   // & ~I2C_MCS_ACK    // no data ack (no data on send)
                                   // & ~I2C_MCS_START  // no start/restart
                                   // & ~I2C_MCS_RUN   // master disable

        // return error bits if nonzero
        return (I2C1->MCS & (I2C_MCS_DATACK | I2C_MCS_ADRACK | I2C_MCS_ERROR));
    }
    I2C1->MDR = data3 & 0xFF;      // prepare third byte

    I2C1->MCS = (I2C_MCS_STOP     // generate stop
                 | I2C_MCS_RUN);  // master enable
                                  // & ~I2C_MCS_ACK     // no data ack (no data on send)
                                  //& ~I2C_MCS_START   // no start/restart
    L_waitTillReady();  // wait for transmission done
        // return error bits
    return (I2C1->MCS & (I2C_MCS_DATACK | I2C_MCS_ADRACK | I2C_MCS_ERROR));
}

// ------------BSP_LightSensor_Init------------
// Initialize a GPIO pin for input, which corresponds
// with BoosterPack pins J1.8 (Light Sensor interrupt).
// Initialize two I2C pins, which correspond with
// BoosterPack pins J1.9 (SCL) and J1.10 (SDA).
// Input: none
// Output: none
// TODO: make interrupt pin/ configure ISR and NVIC
// TODO: use #defined IO definetions (port.h). 
void BSP_LightSensor_Init(void) { // bsp light sensor IO inti
    i2cinit();
    // 1) activate clock for Port A (done in i2cinit())
    // allow time for clock to stabilize (done in i2cinit())
    // 2) no need to unlock PA5
    GPIOA->AMSEL &= ~0x20;  // 3) disable analog on PA5
                                  // 4) configure PA5 as GPIO
    GPIOA->PCTL = (GPIOA->PCTL & 0xFF0FFFFF) + 0x00000000;
    GPIOA->DIR &= ~0x20;    // 5) make PA5 input
    GPIOA->AFSEL &= ~0x20;  // 6) disable alt funct on PA5
    GPIOA->DEN |= 0x20;     // 7) enable digital I/O on PA5
}

// light sensor data DATA_READY
int BSP_LightSensor_INTstatus(void) {
  
    return (BSP_BP_OPT3001_IRQ_PORT->DATA_Bits[BSP_BP_OPT3001_IRQ_PIN] 
            == BSP_BP_OPT3001_IRQ_PIN) ? 1U : 0U;
}
